<a href="https://colab.research.google.com/github/nmusuva/FEB-MySQL-data-challenge/blob/main/tables_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
%load_ext sql

magic command to enable run sql

In [3]:
%sql sqlite:///chinook.db

In [5]:
%sql SELECT name FROM sqlite_master WHERE type = 'table';

 * sqlite:///chinook.db
Done.

[('albums',),
 ('sqlite_sequence',),
 ('artists',),
 ('customers',),
 ('employees',),
 ('genres',),
 ('invoices',),
 ('invoice_items',),
 ('media_types',),
 ('playlists',),
 ('playlist_track',),
 ('tracks',),
 ('sqlite_stat1',)]

In [7]:
%sql PRAGMA table_info(albums);

 * sqlite:///chinook.db
Done.

[(0, 'AlbumId', 'INTEGER', 1, None, 1),
 (1, 'Title', 'NVARCHAR(160)', 1, None, 0),
 (2, 'ArtistId', 'INTEGER', 1, None, 0)]

In [8]:
%sql PRAGMA table_info(artists);

 * sqlite:///chinook.db
Done.

[(0, 'ArtistId', 'INTEGER', 1, None, 1),
 (1, 'Name', 'NVARCHAR(120)', 0, None, 0)]

In [9]:
%sql PRAGMA table_info(genres);

 * sqlite:///chinook.db
Done.

[(0, 'GenreId', 'INTEGER', 1, None, 1),
 (1, 'Name', 'NVARCHAR(120)', 0, None, 0)]

In [11]:
%sql PRAGMA table_info(media_types);

 * sqlite:///chinook.db
Done.

[(0, 'MediaTypeId', 'INTEGER', 1, None, 1),
 (1, 'Name', 'NVARCHAR(120)', 0, None, 0)]

In [10]:
%sql PRAGMA table_info(employees);

 * sqlite:///chinook.db
Done.

[(0, 'EmployeeId', 'INTEGER', 1, None, 1),
 (1, 'LastName', 'NVARCHAR(20)', 1, None, 0),
 (2, 'FirstName', 'NVARCHAR(20)', 1, None, 0),
 (3, 'Title', 'NVARCHAR(30)', 0, None, 0),
 (4, 'ReportsTo', 'INTEGER', 0, None, 0),
 (5, 'BirthDate', 'DATETIME', 0, None, 0),
 (6, 'HireDate', 'DATETIME', 0, None, 0),
 (7, 'Address', 'NVARCHAR(70)', 0, None, 0),
 (8, 'City', 'NVARCHAR(40)', 0, None, 0),
 (9, 'State', 'NVARCHAR(40)', 0, None, 0),
 (10, 'Country', 'NVARCHAR(40)', 0, None, 0),
 (11, 'PostalCode', 'NVARCHAR(10)', 0, None, 0),
 (12, 'Phone', 'NVARCHAR(24)', 0, None, 0),
 (13, 'Fax', 'NVARCHAR(24)', 0, None, 0),
 (14, 'Email', 'NVARCHAR(60)', 0, None, 0)]

In [15]:
%sql SELECT * FROM playlists LIMIT 5;

 * sqlite:///chinook.db
Done.

[(1, 'Music'),
 (2, 'Movies'),
 (3, 'TV Shows'),
 (4, 'Audiobooks'),
 (5, '90’s Music')]

In [16]:
%sql SELECT name FROM playlists LIMIT 5;

 * sqlite:///chinook.db
Done.

[('Music',), ('Movies',), ('TV Shows',), ('Audiobooks',), ('90’s Music',)]

In [18]:
%sql SELECT * FROM employees LIMIT 5;

 * sqlite:///chinook.db
Done.

[(1, 'Adams', 'Andrew', 'General Manager', None, '1962-02-18 00:00:00', '2002-08-14 00:00:00', '11120 Jasper Ave NW', 'Edmonton', 'AB', 'Canada', 'T5K 2N1', '+1 (780) 428-9482', '+1 (780) 428-3457', 'andrew@chinookcorp.com'),
 (2, 'Edwards', 'Nancy', 'Sales Manager', 1, '1958-12-08 00:00:00', '2002-05-01 00:00:00', '825 8 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 2T3', '+1 (403) 262-3443', '+1 (403) 262-3322', 'nancy@chinookcorp.com'),
 (3, 'Peacock', 'Jane', 'Sales Support Agent', 2, '1973-08-29 00:00:00', '2002-04-01 00:00:00', '1111 6 Ave SW', 'Calgary', 'AB', 'Canada', 'T2P 5M5', '+1 (403) 262-3443', '+1 (403) 262-6712', 'jane@chinookcorp.com'),
 (4, 'Park', 'Margaret', 'Sales Support Agent', 2, '1947-09-19 00:00:00', '2003-05-03 00:00:00', '683 10 Street SW', 'Calgary', 'AB', 'Canada', 'T2P 5G3', '+1 (403) 263-4423', '+1 (403) 263-4289', 'margaret@chinookcorp.com'),
 (5, 'Johnson', 'Steve', 'Sales Support Agent', 2, '1965-03-03 00:00:00', '2003-10-17 00:00:00', '7727B 41 Ave', 'Calgary', 'AB', 'Canada', 'T3B 1Y7', '1 (780) 836-9987', '1 (780) 836-9543', 'steve@chinookcorp.com')]

In [20]:
%sql SELECT * FROM invoices LIMIT 5;

 * sqlite:///chinook.db
Done.

[(1, 2, '2009-01-01 00:00:00', 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', 1.98),
 (2, 4, '2009-01-02 00:00:00', 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', 3.96),
 (3, 8, '2009-01-03 00:00:00', 'Grétrystraat 63', 'Brussels', None, 'Belgium', '1000', 5.94),
 (4, 14, '2009-01-06 00:00:00', '8210 111 ST NW', 'Edmonton', 'AB', 'Canada', 'T6G 2C7', 8.91),
 (5, 23, '2009-01-11 00:00:00', '69 Salem Street', 'Boston', 'MA', 'USA', '2113', 13.86)]

In [21]:
%sql SELECT lastname FROM employees;

 * sqlite:///chinook.db
Done.

[('Adams',),
 ('Edwards',),
 ('Peacock',),
 ('Park',),
 ('Johnson',),
 ('Mitchell',),
 ('King',),
 ('Callahan',)]

CREATING AND DELETING TABLES

In [22]:
%%sql CREATE TABLE worker(
    last_name VARCHAR (25),
    worker_id INT NOT NULL PRIMARY KEY,
    first_name VARCHAR (25),
    salary INT (15),
    department VARCHAR (25)
);

 * sqlite:///chinook.db
Done.

[]

CONFIRMING CREATING OF A TABLE

In [24]:
%sql SELECT name FROM sqlite_master WHERE type == 'table';

 * sqlite:///chinook.db
Done.

[('albums',),
 ('sqlite_sequence',),
 ('artists',),
 ('customers',),
 ('employees',),
 ('genres',),
 ('invoices',),
 ('invoice_items',),
 ('media_types',),
 ('playlists',),
 ('playlist_track',),
 ('tracks',),
 ('sqlite_stat1',),
 ('worker',)]

In [25]:
%sql PRAGMA table_info ("worker");

 * sqlite:///chinook.db
Done.

[(0, 'last_name', 'VARCHAR (25)', 0, None, 0),
 (1, 'worker_id', 'INT', 1, None, 1),
 (2, 'first_name', 'VARCHAR (25)', 0, None, 0),
 (3, 'salary', 'INT (15)', 0, None, 0),
 (4, 'department', 'VARCHAR (25)', 0, None, 0)]

In [26]:
%%sql ALTER TABLE worker
ADD email VARCHAR (30);

 * sqlite:///chinook.db
Done.

[]

In [27]:
%%sql PRAGMA table_info ("worker");

 * sqlite:///chinook.db
Done.

[(0, 'last_name', 'VARCHAR (25)', 0, None, 0),
 (1, 'worker_id', 'INT', 1, None, 1),
 (2, 'first_name', 'VARCHAR (25)', 0, None, 0),
 (3, 'salary', 'INT (15)', 0, None, 0),
 (4, 'department', 'VARCHAR (25)', 0, None, 0),
 (5, 'email', 'VARCHAR (30)', 0, None, 0)]

In [ ]:
%%sql INSERT INTO worker (last_name,worker_id,first_name,salary,department)VALUES
('Arora',001,'Monika',1000000,'HR',),